/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"ignore_button" = "忽略";
/* ProgramLog, Details view - AAPLogObject */
"program_log_data_size" = "資料大小";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_status" = "狀態";

/* ProgramLog, Details view, connection ID title. Text - "Connection ID" */
"programlog_details_connection_id_title" = "連線 ID";

/* ProgramLog, Details view, request ID title. Text - "Request ID" */
"programlog_details_request_id_title" = "請求 ID";

/* ProgramLog, Details view, title for event source. Text - "Event source" */
"programlog_details_event_source_title" = "事件來源";

/* ProgramLog, Details view, stealth mode event source. Text - "Stealth mode" */
"programlog_details_event_source_stealth_mode" = "隱身模式";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_cookie" = "Cookie";

/* ProgramLog, details view, status */
"program_log_details_status_html_removed" = "已移除的 HTML 元件";

/* ProgramLog, details view, status */
"program_log_details_status_cookie_modified" = "已修改的 Cookie";

/* ProgramLog, details view, text: "HTML Element" */
"program_log_details_html_element" = "HTML 元件";

/* ProgramLog, details view, text:  "Source URL" */
"program_log_details_source_url" = "來源網址";

/* ProgramLog, filter name cell in request row, when only modified by stealth mode. Text like "Stealth mode" */
"programlog_filtername_cell_stealth_mode" = "隱身模式";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_cookie_original" = "原始";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_cookie_modified" = "已修改";

/* "ProgramLog, filter name cell in request row, when only modified by cosmetic rules. Text like "Cosmetic rules" */
"programlog_filtername_cell_сosmetic_rules" = "修飾規則";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_protocol_title" = "協定";
/* Master password prompt dialog shown during the root certificate installation for Gecko-like browsers. Explanatory text. Text in square brackets will be transformed into instruction hyperlink. */
"master_password_prompt_dialog_certificate_installation_text" = "為了能成功安裝或移除 AdGuard 憑證，%1$@ 需要主密碼。您輸入的密碼將不會被儲存，且只一次性地作為匯入該憑證時使用。或者您可以[按照此方法]手動安裝憑證。\n\n（目前的設定檔：%2$@）";

/* Main Panel - AAStatusBarMenuController */
"main_panel_statistics_since" = "自從 %@ 開始的統計資料";

/* Create empty rule - ASDatabaseObjects */
"entering_rule_database" = "!------- 在這裡輸入規則... -------!";

/* Preferenses - Ad Blocker - AAPrefAdBlockFiltersTableDelegate */
"preferences_adblocker_updated_date" = "%1$@ 更新於 %2$@";

/* (AAAppDelegate) User Notifications */
"certificate_added_to_EVexclusions_notification" = "「%@」 憑證已被加到 EV 例外中。除非各個關於 EV 憑證的選項被停用，否則有此憑證的網站將不被過濾。";

/* AAAppDelegate */
"rule_added_user_filter" = "已增加新的規則到使用者規則中：";

/* AAAppDelegate */
"rule_removed_user_filter" = "已從使用者規則中移除規則：";

/* Main Panel - Activate Button (AAStatusBarMenuController) */
"main_panel_activate_button" = "啟用";

/* License Window - AALicense */
"license_window_activate_license_button" = "啟用";

/* Preferences - Ad Block - Rules Export */
"rules_export_choose_file" = "AdGuard - 選擇檔案以匯出";

/* Preferences - Ad Block - Rules Import */
"rules_import_choose_file" = "AdGuard - 選擇檔案以匯入";

/* (AAPAdBlockCustomFilterSubscribe) Window title when selecting file with local custom filter */
"choosing_file_with_custom_filter_title" = "AdGuard - 選擇自訂過濾器檔案";

/* Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_filtered_apps_choose_app" = "AdGuard - 選擇要被過濾的程式";

/* Master password prompt dialog shown during the root certificate installation for Gecko-like browsers. Window title. */
"master_password_window_title" = "AdGuard - 用於 %@ 的主密碼";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"error_filtering_https_alert_message" = "AdGuard 無法過濾 %@ 的 HTTPS 流量！";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"error_removing_certificate_alert_message" = "AdGuard 無法從 %@ 中移除 AdGuard CA 憑證！";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"root_certificate_installed_text" = "AdGuard 已成功安裝該根憑證到 %@ 憑證庫。HTTPS 過濾已啟用。";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"root_certificate_installed_title" = "AdGuard 已成功安裝根憑證。";

/* AAAppDelegate */
"functioning_stopped_alert_message" = "AdGuard 目前未運作！";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"installing_certificate_failure_text" = "AdGuard 無法安裝根憑證到 %@ 憑證庫！請與客戶支援聯繫。";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"removing_certificate_failure_text" = "AdGuard 無法從 %@ 憑證庫中移除根憑證！AdGuard 重置程序將繼續執行。";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"failed_to_close_alert_message" = "AdGuard 無法關閉 %@。是否重試？";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"installing_certificate_failure_title" = "AdGuard 無法安裝根憑證到 %@ 中！";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"removing_certificate_failure_title" = "AdGuard 無法從 %@ 中移除根憑證！";

/* (AAPreference) Title for the \"Filter EV certificates anyway\" window. */
"filtering_websites_anyway_text" = "儘管下列網站擁有 EV 憑證，AdGuard 仍然會過濾其流量。";

/* (AAPreference) Title for SSL Exception list window. */
"ssl-exception_list_title" = "AdGuard 將不過濾下列網站的加密流量。";

/* Settting message text - AAPrefDomainExclusions */
"no_filtering_for_websites_setting_message_text" = "AdGuard 將不過濾下列網站的流量。";

/* AAAppDelegate */
"incorrect_work_alert_message" = "AdGuard 將無法正常運作！";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_ajax" = "AJAX";

/* AAAppDelegate */
"error_init_database_title" = "在 AdGuard 資料庫初始化期間發生錯誤。AdGuard 無法正常運作。請與支援團隊聯繫。";

/* AAAppDelegate */
"error_init_database_text_template" = "在 AdGuard 資料庫初始化期間發生錯誤。AdGuard 無法正常運作。\n\n... 請在此輸入文字...";

/* (AAAppDelegate) Alert message when update process of the user preferences was completed with error. */
"error_upgrade_preferences_message" = "在使用者偏好設定更新時發生錯誤。AdGuard 無法正常運作。您可嘗試重置應用程式偏好設定，或與支援團隊聯繫。";

/* AAAppDelegate */
"error_upgrade_preferences_title" = "在使用者偏好設定更新時發生錯誤。AdGuard 無法正常運作。請與支援團隊聯繫。";

/* AAAppDelegate */
"error_upgrade_preferences_text_template" = "在該使用者偏好設定之升級期間，錯誤已發生。\nAdGuard 將無法正常地運作。\n\n... 於此填上您的文字 ...";
/* (AAPreferences) Preferences - Network - Enable proxy failure alert. Informative text when common case happened */
"error_starting_http_proxy" = "在嘗試啟用 AdGuard HTTP 代理伺服器時發生錯誤。請與開發者聯繫。";

/* (AAPreferences) Preferences - Network - Enable proxy failure alert. Informative text when port in use. */
"error_starting_http_proxy_port_in_use" = "在嘗試啟用 AdGuard HTTP 代理伺服器時發生錯誤。連接埠 %@ 正在使用中。";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"error_submitting_crash_report" = "在送出崩潰報告時發生錯誤。";

/* (AAAppDelegate) User Notifications */
"error_updating_filters" = "在更新過濾器時發生錯誤。";

/* ProgramLog - AAPLogObject */
"program_log_exception_activated" = "已啟用一項例外";

/* About - AAAbout */
"app_version" = "應用程式版本";

/* (AAPreference) Message text (aka title) on dialog window. It occurs when user disables https filtering in Preferences Network Tab. */
"dialog_window_text_attention" = "注意！";

/* ProgramLog - AAPLogObject */
"program_log_blocked_by_parental" = "已被分級保護控制阻擋";

/* ProgramLog, Details view - AAPLogObject */
"program_log_bytes_received" = "已接收的位元組：";

/* ProgramLog, Details view - AAPLogObject */
"program_log_bytes_sent" = "已傳送的位元組：";
/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_reporter_backend_server" = "無法連線到後端伺服器。";

/* AAAppDelegate */
"error_running_app" = "無法從該位置執行 AdGuard！";

/* (AAPreference) Cancel button for the message about EV settings customization.
   (AAPreference) Cancel button on dialog window. It occurs when user disables https filtering in Preferences Network Tab.
   Preferences - Ad Block - AAPrefAdBlockController */
"cancel_button" = "取消";

/* (AAPreference) Message about EV settings customization. */
"certificate_added_to_EVexclusions_message" = "「%1$@」的憑證已被加到 EV 例外中。除非各個關於 EV 憑證的選項被停用，否則有此憑證的網站將不被過濾。雖然該網站為 EV 憑證，您仍然可強制對「%1$@」 過濾。如果要這樣，請點擊「強制過濾」按鈕。";

/* (AAPAdBlockCustomFilterSubscribe) Title on Close button in error message
   AAAppDelegate
   Alert that GECKO is active (AAGeckoBrowsersAlert)
   Preferences - Ad Block - AAPrefAdBlockController
   Request user about resetting AdGuard (AAResetSettings) */
"close_button" = "關閉";

/* ProgramLog, resource type - AAPLogObject */
"program_log_connection" = "連線";

/* ProgramLog, Details view - Status */
"program_log__connection_blocked" = "已阻擋連線。";

/* UI - License Window - Alert - AdGuard service connection error - Error message */
"activity_status_connection_error" = "連線錯誤。";

/* (AAAppDelegate) User Notifications */
"notification_connection_closed" = "連線已關閉";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_connection" = "連線：";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_content_rules" = "內容規則：";

/* (AAPreference) Continue button on dialog window. It occurs when user disables https filtering in Preferences Network Tab.
   Preferences - Ad Block - AAPrefAdBlockController */
"preferences_network_continue_button" = "繼續";

/* Error converting to email (AASendMessageMailFormatter) */
"error_converting_message" = "無法轉換為有效的電子郵件位址";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"window_controller_crash_reporter" = "崩潰回報程式：%1$@（%2$@）";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"window_controller_crash_reporter1" = "崩潰回報程式：%@";

/* ProgramLog, resource type - AAPLogObject */
"resource_type_css" = "CSS";

/* (AAAppDelegate) User Notifications button */
"user_notification_button_customize" = "自訂";

/* (AAPreference) Title of the message about EV settings customization. */
"filtering_customization_message_title" = "自訂 %@ 網站的過濾";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_data_type" = "資料類型";

/* (AAPrefAdBlockController) Undo operation title. */
"disable_rules_undo_operation_title" = "停用規則";

/* (AAPrefAdBlockController) Undo operation title. */
"edit_filter_undo_operation_title" = "編輯過濾器";

/* (AAPrefAdBlockController) Undo operation title. */
"edit_rule_undo_operation_title" = "編輯規則";

/* (AAPrefAdBlockController) Undo operation title. */
"search_string_undo_operation_title" = "編輯搜尋字串";

/* (AAPrefAdBlockController) Undo operation title. */
"enable_rules_undo_operation_title" = "啟用規則";

/* Master password prompt dialog shown during the root certificate installation for Gecko-like browsers. Placeholder for input field. */
"prompt_dialog_entering_master_password" = "輸入主密碼";

/* (AAPAdBlockCustomFilterSubscribe) Title of the error message. */
"error_loading_filter_title" = "載入過濾器時發生錯誤。";

/* Send feedback to support (AASendMessage) */
"error_sending_message" = "傳送訊息時發生錯誤。";

/* ProgramLog, Details view - AAPLogObject */
"program_log_error_processing_request" = "處理請求時發生錯誤：";

/* ProgramLog - AAPLogObject */
"program_log_error" = "錯誤！";


"enter_domain_name_message" = "請在此輸入域名...";
/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_exit_editing_mode_text" = "您確定要離開「%@」的進階編輯模式嗎？";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_exit_editing_mode_title" = "您要離開進階編輯模式嗎？";

/* (AAPreferences) Preferences - Network - Enable proxy failure alert. Title text. */
"enabling_proxy_failure_alert" = "代理伺服器模式啟用失敗。";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"installing_filters_failure_alert" = "安裝過濾器失敗。";

/* (AAAppDelegate) User Notifications */
"user_notification_filters_auto-activation_text" = "根據您所訪問的網站，過濾器「%@」已自動啟用。";

/* (AAAppDelegate) User Notifications */
"user_notification_filters_auto-activation_title" = "過濾器已自動啟用";

/* (AAPreference) Text on the button in the message about EV settings customization. */
"filter_anyway_message_button" = "強制過濾";


/* ProgramLog, Details view - AAPLogObject */
"program_log_details_filter" = "過濾器：";
/* (AAAppDelegate) User Notifications */
"filters_updated_notification_title" = "已更新過濾器";

/* (AAAppDelegate) User Notifications */
"notification_filters_updated_text" = "已更新的過濾器：%lu。您目前使用的是最新版的過濾器資料庫。";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"alert_fix_this" = "修復";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_font" = "字體";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_html" = "HTML";

/* Request user about resetting AdGuard (AAResetSettings) */
"reseting_settings_request" = "如果您點擊「重置」，AdGuard 將嘗試重置所有設定，包括已啟用的過濾器和自訂的過濾器規則。在重新啟動之後，AdGuard 將初始化所有狀態。";


/* (AAAppDelegate) User Notifications */
"notification_filters_update_error" = "過濾器更新時發生錯誤";
/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_image" = "影像";

/* (AAPrefAdBlockController) Undo operation title. */
"import_rules_undo_operation_title" = "匯入規則";

/* AAAppDelegate */
"important" = "重要";

/* AAAppDelegate */
"information" = "資訊";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_report_backend_server_error" = "內部的後端伺服器發生錯誤。";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_javascript" = "JavaScript";

/* ProgramLog - AAPLogObject */
"program_log_javascript_blocked" = "已阻擋 JavaScript";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_key_does_not_exist" = "授權碼不存在。";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_license_expires" = "授權於*今日*到期。";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_license_expires_in" = "授權於 *%lu 日*內到期。";

/* Activity Status (License Window - AALicense)
   Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_license_expired" = "授權已到期。";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_maximum_exceeded" = "已超出最大裝置數量。";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_media" = "媒體";

/* Send feedback to support (AASendMessage) */
"feedback_message_sent" = "已成功傳送訊息";

/* AAAppDelegate */
"running_app_from_application_folder_message" = "您似乎從安裝磁碟中執行 AdGuard。請拖曳 AdGuard 到應用程式資料夾夾，再從應用程式資料夾執行。";

/* (AAPrefAdBlockController) Undo operation title. */
"new_rule_undo_operation_title" = "新增規則";

/* Preferences - Ad Block - AAPrefAdBlockController
   Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_adblocker_filtered_apps_no" = "否";

/* (AAAppDelegate) User Notifications */
"no_filter_updates_notification" = "找不到過濾器更新";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_object" = "物件";

/* (AAPreferences) Preferences - Network - Enable proxy failure alert. Ok button text
   Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"preferences_network_failure_alert_button" = "確定";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_adblocker_editing_mode_message" = "您每次只能使用進階編輯模式編輯一個過濾器。目前「%1$@」過濾器正在編輯，若您點擊「繼續」，該「%1$@」過濾器的編輯將會被中斷，並且不會儲存任何更變。";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_other" = "其它";

/* (AAPrefAdBlockController) Undo operation title. */
"paste_rules_undo_operation_title" = "貼上規則";

/* ProgramLog - AAPLogObject */
"program_log_phishing_site" = "釣魚網站！";

/* (AAPreference) Informative text on dialog window. It occurs when user disables https filtering in Preferences Network Tab. */
"dialog_window_disabling_https-filtering_text" = "關閉 HTTPS 過濾功能，將會使許多網站與應用程式出現廣告，其中包括 Facebook、YouTube、Twitter 等熱門網站。";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_report_problem_description" = "請敘述導致程式崩潰的先前操作";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_process" = "程序：";

/* Main Panel (AAStatusBarMenuController) */
"main_panel_protection_disabled" = "已停用防護";

/* Main Panel (AAStatusBarMenuController) */
"main_panel_protection_enabled" = "已啟用防護";

/* Main Panel - AAStatusBarMenuController */
"main_panel_purchase" = "購買";

/* License Window - AALicense */
"license_window_purchase_license" = "購買授權";

/* Request user about restarting AdGuard (AAResetSettings) */
"restarting_request_quit" = "結束";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_referrer" = "來源網址";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_remote_address" = "遠端位址：";

/* Preferences - Ad Block - AAPrefAdBlockController
   Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_adblock_filtered_apps_remove" = "移除";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_adblocker_removing_message_title" = "您確定要移除「%@」嗎？";

/* Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_filtered_apps_removing_message_title" = "您確定要移除「%@」嗎？";

/* (AAPrefAdBlockController) Undo operation title. */
"remove_rules_undo_operation_title" = "移除規則";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_adblocker_removing_message_text" = "移除過濾器與停用過濾器不同，移除過濾器將會使其從您的過濾器清單中完全移除，直到您再次訂閱該過濾器。";

/* Preferences - Filtering Apps - AAPrefFilteringAppsSettings */
"preferences_filtered_apps_removing_message_text" = "移除應用程式將會使 AdGuard 完全不過濾其流量。若要過濾該應用程式，您必須手動重新將其加回清單。";

/* License Window - AALicense
   Main Panel - AAStatusBarMenuController */
"main_panel_renew_option" = "更新";

/* License Window - AALicense */
"license_window_renew_license" = "更新授權";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_request_blocked_by" = "請求已被 VPaid 過濾器阻擋。";

/* ProgramLog - AAPLogObject */
"program_log_request_blocked" = "已阻擋請求。";

/* ProgramLog - AAPLogObject */
"program_log_request_processed" = "已處理請求。";

/* Main Panel - AAStatusBarMenuController
   Request user about resetting AdGuard (AAResetSettings) */
"reset_setting_button" = "重置";

/* Request user about resetting AdGuard (AAResetSettings) */
"reset_settings_message" = "您確定要重置 AdGuard 的設定嗎？";

/* License Window - AALicense */
"license_window_reset_key" = "重置授權碼";

/* (AAAppDelegate) Alert message when update process of the user preferences was completed with error. Button one. */
"reset_preferences_alert_button" = "重置偏好設定";

/* Request user about restarting AdGuard (AAResetSettings) */
"restart_button" = "重新啟動";

/* Request user about restarting AdGuard (AAResetSettings) */
"restarting_request_message_text" = "您必須重新啟動 AdGuard 才能恢復其運作。請點擊「重新啟動」。";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"alert_message_retry_button" = "重試";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_rule" = "規則";

/* Preferences - Ad Block - Rules Export */
"preferences_adblocker_rules_export" = "規則";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_safebrowsing_filter" = "安全瀏覽過濾器";

/* Preferences - Ad Block - AAPrefAdBlockController */
"preferences_adblocker_save_button" = "儲存";

/* Send feedback to support (AASendMessage) */
"sending_feedback_process" = "正在傳送...";

/* AAAppDelegate */
"error_filtering_traffic_text" = "過濾網路流量的服務未正常啟動。請與支援團隊聯繫。";

/* AAAppDelegate */
"error_filtering_traffic_text_support" = "過濾網路流量的服務未正常啟動。\n\n... 請在這裡輸入文字...";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"installing_certificate_retry_alert_message" = "%1$@ 正在執行，導致 AdGuard 無法安裝根憑證到憑證庫中，以過濾 HTTPS 流量。如果您選擇「重試」，AdGuard 將關閉 %2$@ 並安裝憑證。";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"removing_certificate_retry_alert_message" = "%1$@ 正在執行，導致 AdGuard 無法從憑證庫移除根憑證，以重置 AdGuard 設定。如果您選擇「重試」，AdGuard 將關閉 %2$@ 並移除憑證。";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"installing_certificate_fixthis_alert_message" = "%1$@ 正在執行，導致 AdGuard 無法安裝根憑證到憑證庫中，以過濾 HTTPS 流量。如果您選擇「修復」，AdGuard 將關閉 %2$@ 並安裝憑證。";

/* Alert that GECKO is active (AAGeckoBrowsersAlert) */
"removing_certificate_fixthis_alert_message" = "%1$@ 正在執行，導致 AdGuard 無法從憑證庫中移除根憑證，以重置 AdGuard 設定。如果您選擇「修復」，AdGuard 將關閉 %2$@ 並移除憑證。";

/* AAAppDelegate */
"error_starting_service_message" = "部分 AdGuard 服務未正常啟動。請與支援團隊聯繫。";

/* AAAppDelegate */
"error_starting_service_support" = "部分 AdGuard 服務未正常啟動。\nAdGuard 將無法正常運作。\n\n... 請在這裡輸入文字...";

/* (AASFilterSubscriptionParser) Error while processing the custom filter file. */
"error_processing_custom_filter_file" = "發生錯誤，或者自訂的過濾器規則檔案格式有誤。";

/* Main Panel - Renew Button (AAStatusBarMenuController) */
"main_panel_renew_button_starting_at_price" = "從";

/* (AAAppDelegate) Alert message when update process of the build settings was completed with error. Button two.
   (AAAppDelegate) Alert message when update process of the user preferences was completed with error. Button two.
   AAAppDelegate */
"support_option" = "支援...";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_reporter_thanks_for_improving" = "感謝您花時間來協助我們改善 %@！";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_report_submitted" = "已成功送出崩潰報告";

/* Crash Reporter UI (SFBCrashReporterWindowController) */
"crash_reporter_error_indication" = "錯誤內容：%@";

/* ProgramLog - AAPLogObject */
"program_log_page_filtered" = "已過濾頁面";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_malicious_site" = "已阻擋請求，因為網站可能是釣魚頁面或惡意網站：";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"preferences_adblocker_outdated_filters_alert_message" = "更新伺服器目前無法使用。現有的過濾器清單已過時！";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"contact_developer_details" = "聯繫開發者...";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"preferences_adblocker_subscribe_filters_text" = "請從下列清單中選取過濾器，之後按下「訂閱」按鈕來訂閱。";

/* Settting message text - AAPrefDomainExclusions */
"setting_whitelist_message_text" = "請先在過濾器分頁中啟用使用者規則，才能使用白名單功能。";

/* License Window - AALicense */
"license_window_trial_expires_in" = "試用於 %lu 天內到期";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_trial_expires_today" = "試用已於*今日*到期。";

/* Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_trial_expires_in" = "試用於 *%lu 天*內到期。";

/* Main Panel - AAStatusBarMenuController */
"main_panel_upgrade_option" = "升級";

/* License Window - AALicense */
"license_window_upgrade_license" = "升級授權";

/* ProgramLog, Details view - AAPLogObject */
"program_log_details_url" = "請求網址";

/* License Window - AALicense */
"license_window_used_on" = "已用於";
/* AAAppDelegate */
"view_option" = "檢視";

/* AAAppDelegate */
"warning" = "警告";

/* ProgramLog, resource type - AAPLogObject */
"program_log_resource_type_websocket" = "WebSocket";

/* Activity Status (License Window - AALicense) */
"activity_status_wrong key" = "錯誤的授權碼。";

/* Preferences - Ad Block - AAPrefAdBlockController */
"exit_editing_mode_alert_message_save" = "您即將離開進階編輯模式。若要儲存更變，請點擊「儲存」按鈕。";

/* (AAAppDelegate) User Notifications */
"using_recent_database_version_notification" = "您正在使用最新版本的過濾器資料庫。";

/* Preferences - Ad Block - AAPrefAdBlockFiltersSubscribe */
"no_more_filters_allowed_alert_message" = "您已訂閱所有可用的過濾器。\n請先移除一些過濾器。";

/* Send feedback to support (AASendMessage) */
"feedback_enter_valid_email" = "您必須輸入有效的電子郵件位置。";

/* Request user about restarting AdGuard (AAResetSettings) */
"restarting_request_message_title" = "您需要重新啟動 AdGuard。";

/* (AAAbout) About window, (All rights reserved) text. */
"about_window_all_rights_reserved" = "© 2009-%lu。AdGuard Software Limited. All rights reserved.";

/* ProgramLog, Details view, unknown filter name for rules block. Text - "Unknown filter". */
"programlog_detailview_rules_unknownfilter" = "未知的過濾器";

/* ProgramLog, rule cell in request row, when replace rules was applyed. Text like "Modified (3 rules)" */
"programlog_rulecell_count" = "已修改（%lu 規則）";

/* ProgramLog, Details view, title for app name. Text - "Application". */
"programlog_detailview_appname_title" = "應用程式";

/* ProgramLog, Details view, destination address title. Text - "Destination address" */
"programlog_detailview_dst_address_title" = "目的位址";

/* ProgramLog, Details view, destination port title. Text - "port:" */
"programlog_detailview_dst_port_title" = "連接埠：";

/* ProgramLog - AAPLogObject. ("Connection blocked.") */
"programlog_detailview_rejected_status" = "已阻擋連線";

/* ProgramLog - AAPLogObject. ("HTTPS connection bypassed.") */
"programlog_detailview_bypass_https_status" = "已繞過 HTTPS 連線";

/* ProgramLog - AAPLogObject. ("Connection bypassed.") */
"programlog_detailview_bypass_status" = "連線被繞過";

/* ProgramLog, Stealth mode option title. Text - "Hiding referrer" */
"programlog_stealth_mode_option_HidingReferrer" = "正在隱藏參照位址";

/* ProgramLog, Stealth mode option title. Text - "Removing cookies from requests and/or response" */
"programlog_stealth_mode_option_BlockingCookies" = "正在從請求與（或）回應中移除 cookies";

/* ProgramLog, Stealth mode option title. Text - "Stripping URLs from tracking parameters like \"utm_source\" etc." */
"programlog_stealth_mode_option_StrippingUrl" = "正在移除網址的追蹤參數，如「utm_source」等等。";

/* ProgramLog, Stealth mode option title. Text - "Hiding real ip address" */
"programlog_stealth_mode_option_HidingIp" = "正在隱藏真實 IP 位址";

/* ProgramLog, Stealth mode option title. Text - "Hiding User-Agent header" */
"programlog_stealth_mode_option_HidingUserAgent" = "正在隱藏使用者代理標頭";

/* ProgramLog, Stealth mode option title. Text - "Adding Do-Not-Track (DNT) header" */
"programlog_stealth_mode_option_SendingDoNotTrackHeader" = "正在加入「不追蹤」標頭";

/* ProgramLog, Stealth mode option title. Text - "Removing X-Client-Data header" */
"programlog_stealth_mode_option_RemovingXClientDataHeader" = "正在移除 X-Client-Data 標頭";

/* ProgramLog, Stealth mode option title. Text - "Sending no-cache header that blocks ETag header (which is used for tracking)" */
"programlog_stealth_mode_option_DisablingThirdPartyCache" = "正在傳送 no-cache 標頭，以阻擋被用於追蹤的實體標籤（ETag）標頭";

/* ProgramLog, Stealth mode option title. Text - "Removing Authorization headers for third-party requests" */
"programlog_stealth_mode_option_BlockingThirdPartyAuthorization" = "正在移除第三方請求的授權標頭";

/* ProgramLog, Stealth mode option title. Text - "Blocking WebRTC" */
"programlog_stealth_mode_option_BlockingWebRtc" = "正在阻擋 WebRTC";

/* ProgramLog, Stealth mode option title. Text - "Blocking push api" */
"programlog_stealth_mode_option_BlockingBrowserPushApi" = "正在阻擋推播 Push API";

/* ProgramLog, Stealth mode option title. Text - "Blocking location api" */
"programlog_stealth_mode_option_BlockingBrowserLocationApi" = "正在阻擋位置定位 API";

/* ProgramLog, Stealth mode option title. Text - "Blocking flash api" */
"programlog_stealth_mode_option_BlockingBrowserFlash" = "正在阻擋 Flash API";

/* ProgramLog, Stealth mode option title. Text - "Blocking java api" */
"programlog_stealth_mode_option_BlockingBrowserJava" = "正在阻擋 Java API";

/* ProgramLog, Details view, title for `stealth mode` block. Text - "Stealth mode". */
"programlog_detailview_stealth_mode_title" = "隱身模式";

/* Add `Kb` unit to Saved Data: "%@ Kb" */
"stat_saved_data_kb" = "%@ KB";

/* Add `Mb` unit to Saved Data: "%@ Mb" */
"stat_saved_data_mb" = "%@ MB";

/* Add `Gb` unit to Saved Data: "%@ Gb" */
"stat_saved_data_gb" = "%@ GB";

/* Main Panel - AAStatusBarMenuController: "Since %@" */
"main_panel_stat_title" = "自從 %@ 以來";

/* Text: "Statistics since %@" */
"main_panel_accessibility_stat_title" = "自從 %@ 以來的統計資料";

/* Text: "System extension allowed" */
"service_kext_allowed_notification_text" = "已允許系統延伸功能";

/* ProgramLog, Details view, title for rules block. Text - "Rules". */
"programlog_detailview_appliedrules_title" = "規則";

/* App starting process. Database error alert. Informative text: "An error occurred while accessing the AdGuard database. This might happen when you try to launch an older version of AdGuard after using a newer one previously." */
"app_alert_newer_db_version" = "當存取 AdGuard 資料庫時發生錯誤。若您在使用新版 AdGuard 之後，再回去使用舊版 AdGuard，就可能導致此問題發生。";

/* Text: AdGuard - Choose a file for exporting logs */
"export_logs_choose_file_panel_title" = "AdGuard - 選擇匯出檔案";

/* Text: Choose folder */
"export_logs_choose_file_panel_button_title" = "匯出";

/* , Warning pannel on bottom of the License Warning Window. Text: Protection will be disabled on %@ */
"license_repr_protection_will_disable" = "防護將於 %@ 停用";

/* Warning pannel on bottom of the License Warning Window. Text: Protection is disabled! */
"license_repr_protection_disabled" = "已停用防護！";

/* Title on the License Warning Window. Text: License\nexpires soon */
"license_repr_title_expires" = "授權\n即將到期";

/* Title on the License Warning Window. Text: Trial period has\nstarted */
"license_repr_title_trial_expires" = "已開始\n試用";

/* Title on the License Warning Window. Text: Trial period\nhas expired */
"license_repr_title_trial_expired" = "試用\n已到期";

/* Title on the License Warning Window. Text: License\nis expired */
"license_repr_title_expired" = "授權\n已到期";

/* License Warning Window in trial mode. Text: Trial version\n%lu days left */
"license_repr_trial_version_left" = "試用期\n剩下 %lu 天";

/* App name for filtering log. Text: AdGuard Proxy */
"adguard_proxy_app_name" = "AdGuard 代理伺服器";

/* Dialog for moving application to Application folder */
"move_app_cant_move" = "無法移動到應用程式資料夾";

/* Dialog for moving application to Application folder */
"move_app_cancel_button_title" = "不要移動";

/* Dialog for moving application to Application folder */
"move_app_message" = "若您想要，AdGuard 可以移動自身到應用程式資料夾。";

/* Dialog for moving application to Application folder */
"move_app_move_button_title" = "移動到應用程式資料夾";

/* Dialog for moving application to Application folder */
"move_app_title" = "移動到應用程式資料夾嗎？";

/* Dialog for moving application to Application folder */
"move_app_password_required_message" = "請注意，這將需要管理員密碼。";

/* Dialog for moving application to Application folder */
"move_app_warning_message" = "為了使得未來能夠正常更新，目前必須執行該動作。";

/* Text: Protection enabled */
"notification_first_successful_start" = "已啟用防護";

/* Preferenses - Extensions - Modified by user mark.*/
"preferences_extensions_modified_mark" = "已修改";

/* Preferenses - Extensions - Modified by user tooltip.*/
"preferences_extensions_modified_tooltip" = "您已修改此延伸功能。";

/* Preferenses - Extensions - Window title when selecting file with local custom extension */
"preferences_extensions_choosing_file_with_custom_extension" = "AdGuard - 選擇包含延伸功能的檔案";

/* Preferenses - Extensions - Error while processing the userscript file. */
"preferences_extensions_error_processing_userscript_file" = "發生錯誤，或者延伸功能的腳本檔案格式有誤。";

/* Preferenses - Extensions - Text: This userscript installed already. */
"preferences_extensions_already_installed_title" = "已安裝使用者腳本";

/* Preferenses - Extensions - Parametes editor window title template.*/
"preferenses_extensions_parameters_editor_title" = "參數 - %@";

/* Preferenses - Extensions - Installation custom extension - Error loading. */
"preferences_extensions_error_loading_extension_title" = "載入延伸功能時發生錯誤";

/* Preferenses - Extensions - Installation custom extension - Installation error title. */
"preferences_extensions_installation_error_title" = "延伸功能安裝失敗";

/* Preferenses - Extensions - Installation custom extension - Saving error message. */
"preferences_extensions_installation_error_message" = "當儲存延伸功能時發生錯誤。請與支援聯繫。";

/* Preferenses - Extensions - Installation custom extension - Already installed erro message. */
"preferences_extensions_already_installed_message" = "「%@」 已安裝腳本。若要取代舊的版本，請按「繼續」。";

/* Preferenses - Extensions - Removing warning title. */
"preferences_extensions_remove_warning_title" = "您確定要刪除所選的延伸功能嗎？";

/* Preferenses - Extensions - Removing warning message. */
"preferences_extensions_remove_warning_message" = "若您點擊「繼續」，將會永久刪除改延伸功能。";

/* Preferenses - Extensions - Parametes editor error title. */
"preferenses_extensions_parameters_editor_error_title" = "檢查延伸功能參數時發生錯誤。";

/* Preferenses - Extensions - Parametes editor text encoding error message. */
"preferenses_extensions_parameters_editor_text_encoding_error_message" = "延伸功能的參數文字無法正確的被轉換為 UTD-8。或許在文字中有特殊的字元。";

/* Preferenses - Extensions - Parametes editor not dictionary error message. */
"preferenses_extensions_parameters_editor_not_dictionay_error_message" = "延伸功能的參數應作為 JSON 目錄，也就是 {\"string\":\"string\"} 的狀態。";

/* Preferenses - Extensions - Parametes editor, parameter value type error message. */
"preferenses_extensions_parameters_editor_value_type_error_message" = "必須指定「%@」的數值類型（數值字串必須有這些前綴：\"[LString;\"、\"[I;\"、\"[B;\"）";

/* Preferenses - Extensions - On editor window closing. Changed extension script warning title. */
"preferences_extensions_script_changed_warning_title" = "已修改延伸功能腳本";

/* Preferenses - Extensions - On editor window closing. Changed extension script warning message. */
"preferences_extensions_script_changed_warning_message" = "若要儲存修改並關閉視窗，請點擊「儲存並關閉」。若要關閉編輯器不儲存修改，請點擊「關閉」。";

/* Preferenses - Extensions - Editor check script error title */
"preferences_extensions_editor_check_script_error_title" = "檢查延伸功能腳本時發生錯誤";

/* Preferenses - Extensions - Editor check script name error message */
"preferences_extensions_editor_check_script_name_error" = "該延伸功能腳本的中繼資料中，必須要有 'name' 欄位。";

/* Common used 'Save & Close' title for buttons */
"save_and_close_button" = "儲存並關閉";

/* Common used 'Close Anyway' title for buttons */
"close_anyway_button" = "關閉";

/* Common used 'Continue' title for buttons */
"continue_button" = "繼續";

/* Activity Status (License Window - AALicense)
   Main Panel - AAStatusBarMenuController (In message template you may place 'strong' text between asterisk) */
"main_panel_trial_expired" = "試用已到期。";

/* UI - License Window - Account Activation Window - Account has no license - Error message. */
"license_window_account_no_license_error" = "未找到任何適用的授權碼以啟用 AdGuard";

/* License - Account service - Error while logining in to AdGuard account. */
"license_oauth_service_error" = "發生錯誤，無法從 AdGuard 獲得授權";

/* UI - License Window - Account Activation Window - Bad credential - Error message. */
"license_window_account_bad_credential_error" = "無效的使用者名稱或密碼";

/* UI - License Window - Account Activation Window - Account is disabled - Error message. */
"license_window_account_account_is_disabled_error" = "帳戶被停用";

/* UI - License Window - Account Activation Window - Account is locked - Error message. */
"license_window_account_account_is_locked_error" = "帳戶被暫時鎖定";

/* UI - License Window - Account Activation Window - Invalid 2FA token - Error message. */
"license_window_account_invalid_2fa_token_error" = "無效的兩步驟代碼";

/* UI - License Window - 'None' status */
"license_window_status_none" = "無";

/* UI - License Window - Status. Active status */
"license_window_status_active" = "有效";

/* UI - License Window - Status. License expired status */
"license_window_status_license_expired" = "已到期";

/* UI - License Window - Status. Trial expired status */
"license_window_status_trial_expired" = "試用已到期";

/* UI - License Window - Status. Expired soon status */
"license_window_status_expired_soon" = "授權即將到期";

/* UI - License Window - Status. Wron key status */
"license_window_status_does_not_exist" = "授權碼錯誤";

/* UI - License Window - Status. Wron key status - Long description */
"license_window_status_does_not_exist_long" = "找不到授權碼！請確定您輸入了正確的授權碼，或者[登入]您的帳號以找到授權碼。";

/* UI - License Window - Status. Maximum exceeded status */
"license_window_status_maximum_exceeded" = "超過最大數量";

/* UI - License Window - Status. Maximum exceeded status - Long description */
"license_window_status_maximum_exceeded_long" = "已在最大數量的裝置上啟用此授權，請[解除][1]其中一個裝置以繼續，或者[購買][2]新的授權碼。";

/* UI - License Window - Status. Blocked status */
"license_window_status_blocked" = "已封鎖";

/* UI - License Window - Status. Blocked status - Long description */
"license_window_status_blocked_long" = "該授權碼已被封鎖。請與 AdGuard 支援聯繫以獲得更多細節。";

/* UI - License Window - Status. License lifetime status */
"license_window_status_lifetime" = "終身授權";

/* UI - License Window - Type. Normal type */
"license_window_standard_license" = "標準版";

/* UI - License Window - Type. Premium type */
"license_window_premium_license" = "高級版";

/* UI - License Window - Type. Bonus type */
"license_window_bonus_license" = "獎勵授權";

/* UI - License Window - Type. Beta type */
"license_window_beta_license" = "測試版";

/* UI - License Window - Type. Trial type */
"license_window_trial_licence" = "試用版";

/* UI - License window - Title of the error alert */
"license_ui_error_titile" = "注意";

/* UI - License Window - License period 'None' */
"license_window_period_none" = "無";

/* UI - License Window - License period days value */
"license_window_period_days_left" = "剩下 %lu 天";

/* UI - License Window - License period 'Today left' value */
"license_window_period_today_left" = "今天到期";

/* UI - License window - License period 'Lifetime' value */
"license_window_period_lifetime_title" = "終身";

/* UI - Welcome window - HTTPS Filtering - Warning message with link to Knowledge Base */
"welcome_window_https_lean_more" = "HTTPS 過濾需要安裝根憑證。[了解更多]有關其運作方式的資訊。";
